#+TITLE: fish-progress

Simple progress bar for the [[https://fishshell.com/][fish shell]].

** Installation
Install using =fisher add lepisma/fish-progress=.

** Usage
#+begin_src shell :exports both
# Doing print_progress $total $current_count prints a single state
print_progress 100 34
#+end_src

#+RESULTS:
: ::   34 / 100 ███████████████████████——————————————————————————————————————————————

#+begin_src shell
# Using a carriage return to refresh the bar
for i in (seq 1 100)
    sleep 1
    print_progress 100 $i
    echo -ne "\r"
end
#+end_src
